In [1]:
# ===========================================================
# 1. Load and Explore the Original Student Dataset
# ===========================================================
import pandas as pd

# Load the original dataset
file_path = "data.csv"   # <-- change to your actual file name
df = pd.read_csv(file_path, delimiter=';')

print("✅ Dataset loaded successfully!\n")
print("Shape:", df.shape)
print("\nColumns available:\n")
print(df.columns.tolist())

# Show first 5 rows
display(df.head())

✅ Dataset loaded successfully!

Shape: (4424, 37)

Columns available:

['Marital status', 'Application mode', 'Application order', 'Course', 'Daytime/evening attendance\t', 'Previous qualification', 'Previous qualification (grade)', 'Nacionality', "Mother's qualification", "Father's qualification", "Mother's occupation", "Father's occupation", 'Admission grade', 'Displaced', 'Educational special needs', 'Debtor', 'Tuition fees up to date', 'Gender', 'Scholarship holder', 'Age at enrollment', 'International', 'Curricular units 1st sem (credited)', 'Curricular units 1st sem (enrolled)', 'Curricular units 1st sem (evaluations)', 'Curricular units 1st sem (approved)', 'Curricular units 1st sem (grade)', 'Curricular units 1st sem (without evaluations)', 'Curricular units 2nd sem (credited)', 'Curricular units 2nd sem (enrolled)', 'Curricular units 2nd sem (evaluations)', 'Curricular units 2nd sem (approved)', 'Curricular units 2nd sem (grade)', 'Curricular units 2nd sem (without evaluations)', 'Unemployment rate', 'Inflation rate', 'GDP', 'Target']

,Marital status,Application mode,Application order,Course,Daytime/evening attendance\t,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,Father's qualification,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,1,17,5,171,1,1,122.0,1,19,12,...,0,0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,1,15,1,9254,1,1,160.0,1,1,3,...,0,6,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,1,1,5,9070,1,1,122.0,1,37,37,...,0,6,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,1,17,2,9773,1,1,122.0,1,38,37,...,0,6,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,2,39,1,8014,0,1,100.0,1,37,38,...,0,6,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

In [2]:
# ===========================================================
# 2. Select Relevant Columns
# ===========================================================

columns_to_keep = [
   
    "Previous qualification (grade)",
    "Admission grade",
    "Age at enrollment",
    "Curricular units 1st sem (approved)",
    "Curricular units 1st sem (grade)",
    "Curricular units 2nd sem (approved)",
    "Curricular units 2nd sem (grade)",
    "Target"
]

df = df[columns_to_keep]

print("✅ Selected columns:")
print(df.columns.tolist())

display(df.head())

✅ Selected columns:
['Previous qualification (grade)', 'Admission grade', 'Age at enrollment', 'Curricular units 1st sem (approved)', 'Curricular units 1st sem (grade)', 'Curricular units 2nd sem (approved)', 'Curricular units 2nd sem (grade)', 'Target']

,Previous qualification (grade),Admission grade,Age at enrollment,Curricular units 1st sem (approved),Curricular units 1st sem (grade),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Target
0,122.0,127.3,20,0,0.000000,0,0.000000,Dropout
1,160.0,142.5,19,6,14.000000,6,13.666667,Graduate
2,122.0,124.8,19,0,0.000000,0,0.000000,Dropout
3,122.0,119.6,20,6,13.428571,5,12.400000,Graduate
4,100.0,141.5,45,5,12.333333,6,13.000000,Graduate

In [3]:
# ===========================================================
# 4. Check Target Distribution
# ===========================================================
print(df["Target"].value_counts())

Target
Graduate    2209
Dropout     1421
Enrolled     794
Name: count, dtype: int64

In [4]:
# ===========================================================
# 5. Save Cleaned Dataset
# ===========================================================
output_path = "cleaned_student_data_v2.csv"
df.to_csv(output_path, index=False)
print(f"✅ Cleaned dataset saved as {output_path}")

✅ Cleaned dataset saved as cleaned_student_data_v2.csv